

///////////光センサー///////////

#define cdsPin 1

//////////////////////////////



/////////サーボモーター////////

#include <Servo.h>
#define motorPin 3
Servo myservo;

/////////////////////////////







void setup() {

/////////サーボモーター////////
  
  myservo.attach(motorPin,700,2300);

/////////////////////////////



///////////光センサー///////////
  
  Serial.begin(9600);
  pinMode(cdsPin, INPUT_PULLUP);

//////////////////////////////

}

void loop() {



///////////光センサー///////////
  // R1のAD値を取得
  float cds_ad = analogRead(cdsPin);

  // AD値を電圧値に変換
  float cds_v = cds_ad * 5 / 1023;

  // 電圧値より、Lux計算
  float lux = 10000 * cds_v / (5 - cds_v) / 1000;

  Serial.print(lux);
  Serial.println(" Lux ");
//////////////////////////////



////////////距離を感知してモーターの動きをかえる/////////////////

//if (lux < 20){　　　　}と書いてある「<」「20」に変更することができます
//これは、20ルクスだと、その｛　　　｝の中の反応が起こります。
//それ以外のときにどんな動きをさせるかは、else｛　　｝の中に書きます。
//今回は、myservo.write(1500);と書いてるので、20ルクス以内ではないときは、止まるようになっています。

///////////////////////////////////////////////////////////




  
if (lux < 20) { 


  myservo.write(1400);
  delay(100);
 
  } else {

  myservo.write(1500);
  delay(100);

 }

}
